const fs = require('fs');

const data = [
  '200 积分 ---- 晨光(M&G)文具4B粉色橡皮 学生考试橡皮擦 乐桃派对系列通用橡皮 开学文具 单个装AXP963C8',
  '400 积分 ---- 三只松鼠 地锅脆片 锅巴薯片休闲小吃零食小吃膨化食品儿童食品85g/袋',
  '600 积分 ---- 妙洁 金属钢丝球洗碗球去油污 3 只装锅具清洁球',
  '700 积分 ---- 澳丹奴（AUDIANO）TM-2009 优棉毛巾颜色随机20 条起售',
  '700 积分 ---- 美丽雅洗碗布海绵百洁布抹布家用厨房去油污刷碗清洁海绵擦彩条 3 只装',
  '700 积分 ---- 上海硫磺皂除螨香皂 130g 清洁控油肥皂',
  '700 积分 ---- 京东京造 蜂蜜山楂条 100g 童年零食 果脯蜜饯 果干小吃 休闲食品中秋礼物礼品',
  '800 积分 ---- 百草味 刀刀辣条 180g 大刀肉面筋怀旧儿时麻辣味零食小吃',
  '800 积分 ---- 佳洁士牙膏全优 7 效防蛀抗牙菌斑牙膏 40g 旅行装（新老包装,随机发货）7 效合 1 清新口气 全面健康防护',
  '800 积分 ---- 百草味 红薯片办公室休闲零食 ins 网红特产小零食 原味地瓜脆片 70g/袋',
  '800 积分 ---- 三只松鼠多味花生 坚果炒货地方特产休闲零食花生米 205g/袋',
  '900 积分 ---- 百乐（PILOT）BX-V5 直液式走珠笔中性笔 0.5mm 针管水笔签字笔 彩色学生考试笔 蓝黑',
  '900 积分 ---- 百乐（PILOT）BX-V5 直液式走珠笔中性笔 0.5mm 针管水笔签字笔 彩色学生考试笔 橙色',
  '900 积分 ---- 百乐（PILOT）BX-V5 直液式走珠笔中性笔 0.5mm 针管水笔签字笔 彩色学生考试笔 红色',
  '900 积分 ---- 双汇 火腿肠 润口香甜王 玉米风味香肠 30g*9/袋',
  '900 积分 ---- 金锣 火腿肠 玉米香甜王 30g*9 支',
  '1000 积分 ---- 良品铺子 泡椒脆笋 素食小吃 休闲零食 泡椒辣味 188g',
  '1000 积分 ---- DSB 2400 枚 29×20mm 不干胶标签贴纸自粘性标贴 40 枚/张 60 张/包 易撕口取纸姓名贴价格贴 4623 红色',
  '1000 积分 ---- 洁丽雅 素色条纹新疆纯棉毛巾成人男女洗脸洗澡面巾汗巾家用兰色 30*60cm',
  '1000 积分 ---- 红棉 纯正 红糖 甘蔗红糖 400g'
];

fs.writeFile('data.txt', data.join('\n'), (err) => {
  if (err) {
    throw err;
  }
  console.log('数据已写入文件');
});